In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\bsmun\anaconda3\lib\site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in c:\users\bsmun\anaconda3\lib\site-packages (from mysql-connector-python) (4.21.12)

#### Method
* Make connection
* Create a cursor
* Run the queries with execute

In [1]:
#importing required libraries
import mysql.connector

In [2]:
# Create connection
mydb = mysql.connector.connect(
    host='localhost',
    user='root',
    password='Mmbsaksd7736@'
)

# Create cursor
mycursor = mydb.cursor()

# Create the 'Assignment' database
mycursor.execute('CREATE DATABASE Assignment')

# Close the connection
mydb.close()

In [3]:
# Connect to the MySQL server with provided credentials and select the 'assignment' database
mydb = mysql.connector.connect(
    host='localhost',      # Specify the host (in this case, localhost)
    user='root',           # Specify the MySQL user (in this case, root)
    password='Mmbsaksd7736@',  # Specify the password for the user
    database='assignment'   # Specify the database to connect to (in this case, 'assignment')
)

# Create a cursor to interact with the database
mycursor = mydb.cursor()

In [4]:
# Execute the 'SHOW TABLES' query to retrieve the list of tables
mycursor.execute('SHOW TABLES')

# Iterate through the result set and print each table
for table in mycursor:
    print(table)

In [5]:
# SQL query to create the 'employee' table
query1 = '''CREATE TABLE employee(
    emp_id INT PRIMARY KEY,
    fname VARCHAR(20) NOT NULL,
    lname VARCHAR(20) NOT NULL,
    age INT NOT NULL,
    gender VARCHAR(20) NOT NULL,
    salary INT NOT NULL,
    city VARCHAR(20) NOT NULL,
    dept VARCHAR(20) NOT NULL
)'''

# Execute the CREATE TABLE query
mycursor.execute(query1)

In [6]:
# Execute the 'SHOW TABLES' query to retrieve the list of tables
mycursor.execute('SHOW TABLES')

# Iterate through the result set and print each table
for table in mycursor:
    print(table)

('employee',)

In [7]:
# SQL query to create the 'dept' table
query2 = '''CREATE TABLE dept(
    dept_id INT PRIMARY KEY,
    dept_name VARCHAR(20) NOT NULL,
    UNIQUE(dept_name)
)'''

# Execute the CREATE TABLE query
mycursor.execute(query2)

In [8]:
# Sample data to insert
data_to_insert = (1, 'John', 'Doe', 30, 'Male', 50000, 'New York', 'IT')

# SQL query to insert data into the 'employee' table
data_insert_query = "INSERT INTO employee(emp_id, fname, lname, age, gender, salary, city, dept) VALUES (%s, %s, %s, %s, %s, %s, %s, %s);"

# Execute the INSERT query with the provided data
mycursor.execute(data_insert_query, data_to_insert)

# Commit the changes to the database
mydb.commit()

In [10]:
# SQL query to select all rows from the 'employee' table
query3 = "SELECT * FROM employee"

# Execute the SELECT query
mycursor.execute(query3)

# Iterate through the result set and print each row
for row in mycursor:
    print(row)

(1, 'John', 'Doe', 30, 'Male', 50000, 'New York', 'IT')

In [11]:
# Sample data to insert
data_to_insert_many = [
    (2, 'Jane', 'Doe', 25, 'Female', 45000, 'Los Angeles', 'HR'),
    (3, 'Bob', 'Smith', 35, 'Male', 60000, 'Chicago', 'Finance'),
    (4, 'Alice', 'Johnson', 28, 'Female', 55000, 'Seattle', 'Marketing'),
    (5, 'Charlie', 'Brown', 32, 'Male', 60000, 'San Francisco', 'IT'),
    (6, 'Eva', 'Williams', 29, 'Female', 52000, 'Boston', 'HR'),
    (7, 'David', 'Miller', 45, 'Male', 75000, 'Austin', 'Finance'),
    
]

# SQL query to insert data
insert_query_for_many = "INSERT INTO employee (emp_id, fname, lname, age, gender, salary, city, dept) VALUES (%s, %s, %s, %s, %s, %s, %s, %s);"

# Execute the INSERT query for all rows of data
mycursor.executemany(insert_query_for_many, data_to_insert_many)

# Commit the changes
mydb.commit()

In [12]:
# SQL query to select all rows from the 'employee' table
query3 = "SELECT * FROM employee"

# Execute the SELECT query
mycursor.execute(query3)

# Iterate through the result set and print each row
for row in mycursor:
    print(row)

(1, 'John', 'Doe', 30, 'Male', 50000, 'New York', 'IT')
(2, 'Jane', 'Doe', 25, 'Female', 45000, 'Los Angeles', 'HR')
(3, 'Bob', 'Smith', 35, 'Male', 60000, 'Chicago', 'Finance')
(4, 'Alice', 'Johnson', 28, 'Female', 55000, 'Seattle', 'Marketing')
(5, 'Charlie', 'Brown', 32, 'Male', 60000, 'San Francisco', 'IT')
(6, 'Eva', 'Williams', 29, 'Female', 52000, 'Boston', 'HR')
(7, 'David', 'Miller', 45, 'Male', 75000, 'Austin', 'Finance')

In [12]:
query3 = "SELECT SUM(salary) FROM employee"

# Execute the SELECT query
mycursor.execute(query3)

# Iterate through the result set and print each row
for row in mycursor:
    print(row)

(Decimal('397000'),)

In [13]:
# SQL query to update the 'salary' for the employee with 'emp_id' equal to 1
query4 = "UPDATE employee SET salary = %s WHERE emp_id = %s;"

# Data for the UPDATE query
update_salary_data = (84000, 1)

# Execute the UPDATE query with the provided data
mycursor.execute(query4, update_salary_data)

# Commit the changes to the database
mydb.commit()

In [14]:
# SQL query to select all rows from the 'employee' table
query3 = "SELECT * FROM employee"

# Execute the SELECT query
mycursor.execute(query3)

# Iterate through the result set and print each row
for row in mycursor:
    print(row)

(1, 'John', 'Doe', 30, 'Male', 84000, 'New York', 'IT')
(2, 'Jane', 'Doe', 25, 'Female', 45000, 'Los Angeles', 'HR')
(3, 'Bob', 'Smith', 35, 'Male', 60000, 'Chicago', 'Finance')
(4, 'Alice', 'Johnson', 28, 'Female', 55000, 'Seattle', 'Marketing')
(5, 'Charlie', 'Brown', 32, 'Male', 60000, 'San Francisco', 'IT')
(6, 'Eva', 'Williams', 29, 'Female', 52000, 'Boston', 'HR')
(7, 'David', 'Miller', 45, 'Male', 75000, 'Austin', 'Finance')

In [15]:
# SQL query to delete the employee with 'emp_id' equal to 7
query5 = "DELETE FROM employee WHERE emp_id = %s"

# Data for the DELETE query
delete_data = (7,)

# Execute the DELETE query with the provided data
mycursor.execute(query5, delete_data)

# Commit the changes to the database
mydb.commit()

In [16]:
# SQL query to select all rows from the 'employee' table
query3 = "SELECT * FROM employee"

# Execute the SELECT query
mycursor.execute(query3)

# Iterate through the result set and print each row
for row in mycursor:
    print(row)

(1, 'John', 'Doe', 30, 'Male', 84000, 'New York', 'IT')
(2, 'Jane', 'Doe', 25, 'Female', 45000, 'Los Angeles', 'HR')
(3, 'Bob', 'Smith', 35, 'Male', 60000, 'Chicago', 'Finance')
(4, 'Alice', 'Johnson', 28, 'Female', 55000, 'Seattle', 'Marketing')
(5, 'Charlie', 'Brown', 32, 'Male', 60000, 'San Francisco', 'IT')
(6, 'Eva', 'Williams', 29, 'Female', 52000, 'Boston', 'HR')

In [17]:
mycursor.execute('DROP DATABASE Assignment')